package com.example.testdialogflow.Data;

public class Question9 {

    public String  Questions9[] = {
            "เบื่อ ไม่สนใจอยากทำอะไร",
            "ไม่สบายใจ ซึมเศร้า ท้อแท้",
            "หลับยากหรือหลับๆตื่นๆหรือหลับมากไป",
            "เหนื่อยง่ายหรือไม่ค่อยมีแรง",
            "เบื่ออาหารหรือกินมากเกินไป",
            "รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลวหรือครอบครัวผิดหวัง",
            "สมาธิไม่ดี เวลาทาอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทางานที่ต้องใช้ความตั้งใจ",
            "พูดช้า ทาอะไรช้าลงจนคนอื่นสังเกตเห็นได้ หรือกระสับกระส่ายไม่สามารถ อยู่นิ่งได้เหมือนที่เคยเป็น",
            "คิดทาร้ายตนเอง หรือคิดว่าถ้าตายไปคงจะดี"
    };

    public  String choices9[][] ={
            {"ไม่มีเลย","เป็นบางวัน 1-7 วัน","เป็นบ่อย > 7วัน","เป็นทุกวัน"},
            {"เป็นบางวัน 1-7 วัน","ไม่มีเลย","เป็นทุกวัน","เป็นบ่อย > 7วัน"},
            {"เป็นบ่อย > 7วัน","เป็นบางวัน 1-7 วัน","ไม่มีเลย","เป็นทุกวัน"},
            {"ไม่มีเลย","เป็นบ่อย > 7วัน","เป็นทุกวัน","เป็นบางวัน 1-7 วัน"},
            {"เป็นบางวัน 1-7 วัน","ไม่มีเลย","เป็นบ่อย > 7วัน","เป็นทุกวัน"},
            {"ไม่มีเลย","เป็นทุกวัน","เป็นบางวัน 1-7 วัน","เป็นบ่อย > 7วัน"},
            {"เป็นบางวัน 1-7 วัน","เป็นบ่อย > 7วัน","ไม่มีเลย","เป็นทุกวัน"},
            {"เป็นทุกวัน","ไม่มีเลย","เป็นบางวัน 1-7 วัน","เป็นบ่อย > 7วัน"},
            {"ไม่มีเลย","เป็นบางวัน 1-7 วัน","เป็นบ่อย > 7วัน","เป็นทุกวัน"}
    };





    public String getQuestion(int a){
        String Question = Questions9[a];
        return Question;
    }


    public String getChoice1(int a){
        String choice = choices9[a][0];
        return choice;
    }

    public String getChoice2(int a){
        String choice = choices9[a][1];
        return choice;
    }

    public String getChoice3(int a){
        String choice = choices9[a][2];
        return choice;
    }

    public String getChoice4(int a){
        String choice = choices9[a][3];
        return choice;
    }
}
